---
kind: type
id: T:Autodesk.Revit.DB.TessellatedShapeBuilderFallback
source: html/ce755fa3-8727-2cd3-dbc3-c952bdc83a17.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderFallback

Describes what TessellatedShapeBuilder function
 should do, if it cannot build a requested TessellatedShapeBuilderTarget .

## Syntax (C#)
```csharp
public enum TessellatedShapeBuilderFallback
```